package com.elouyi.bely.data


public object ErrorCode {

    public val publicCode: Array<Pair<Int, String>> = arrayOf(
        // 权限类
        -1 to "应用程序不存在或已被封禁",
        -2 to "Access Key错误",
        -3 to "API校验密匙错误",
        -4 to "调用方对该Method没有权限",
        -101 to "账号未登录",
        -102 to "账号被封停",
        -103 to "积分不足",
        -104 to "硬币不足",
        -105 to "验证码错误",
        -106 to "账号非正式会员或在适应期",
        -107 to "应用不存在或者被封禁",
        -108 to "未绑定手机",
        -110 to "未绑定手机",
        -111 to "csrf 校验失败",
        -112 to "系统升级中",
        -113 to "账号尚未实名认证",
        -114 to "请先绑定手机",
        -115 to "请先完成实名认证",

        // 请求类
        -304 to "木有改动",
        -307 to "撞车跳转",
        -400 to "请求错误",
        -401 to "未认证",
        -403 to "访问权限不足",
        -404 to "啥都木有",
        -405 to "不支持该方法",
        -409 to "冲突",
        -500 to "服务器错误",
        -503 to "过载保护,服务暂不可用",
        -504 to "服务调用超时",
        -509 to "超出限制",
        -616 to "上传文件不存在",
        -617 to "上传文件太大",
        -625 to "登录失败次数太多",
        -626 to "用户不存在",
        -628 to "密码太弱",
        -629 to "用户名或密码错误",
        -632 to "操作对象数量限制",
        -643 to "被锁定",
        -650 to "用户等级太低",
        -625 to "重复的用户",
        -658 to "Token 过期",
        -662 to "密码时间戳过期",
        -688 to "地理区域限制",
        -689 to "版权限制",
        -701 to "扣节操失败",
        -8888 to "对不起，服务器开小差了~ (ಥ﹏ಥ)"
    )
}